#include "music.h"
#include "timer.h"

#define MUSIC_LENGTH		255
#define	MUSIC_STEP_TIME		129		// 129ms
#define	MUSIC_CONTINUE_TIME	13		// 13ms
#define	TONE_FLAG		0x80
#define	TONE_FLAG_Msk	0x0f
// E 大调 E、#F、#G、A、B、#C、#D
u16 tone[] = {
//低 1     2     3     4     5     6     7
	// 165,  185,  208,  220,  247,  277,  311,
	330,  370,  415,  440,  494,  554,  622,
//中 1     2     3     4     5     6     7
	659,  740,  831,  880,  988,  1109, 1245,
//高 1     2     3     4     5     6     7
	1319, 1480, 1661, 1760, 1976, 2217, 2489,
};//音频数据表
u16 tone_pwm_arr[] = {
	1000,
//低 1     2     3     4     5     6     7
	// 6060, 5405, 4807, 4545, 4048, 3610, 3215,
	3030, 2702, 2409, 2272, 2024, 1805, 1607,
//中 1     2     3     4     5     6     7
	1517, 1351, 1203, 1136, 1012, 901,  803,
//高 1     2     3     4     5     6     7
	758,  675,  602,  568,  506,  451,  401,
};//音频数据表

static unsigned char bMusic_time[] = {		// 单位：四分之一拍 129ms
	2,2, 2,2, 4, 2,2,
//	告   别了 家  乡
	4, 2,2, 2, 6,
//  亲 切的 明 月，
	4, 2,2, 2,4,2, 16,
//  亲 切的  明     月，
	2,2,2,2, 4, 2,2,
//  迎来了   校  园
	4, 2,2, 4, 4,
//  灿 烂的 朝 阳，
	2, 4, 2, 4,2,2, 16,
//  灿 烂 的  朝     阳。
	4, 2,2, 8,
//	八 角   塘
	4,2,2, 8,
//  映     日
	4,2,2, 4,2,2,
//	荷花   别样
	4,4,8,
//  红，
	4,2,2, 4,4,
//  赣江   水
	2,2,2,2, 8,
//  源       头
	4, 4, 2,4, 2,16,
//  万 涓 泛波  浪。
	8, 6, 2,
//  走 进 这
	6,2, 8,
//  梦   想
	4, 2,2, 4,4, 16,
//  梦 想的 殿    堂，
	4, 2,2, 6, 2,
//  年 轻的 心  啊
	2,2, 2,2, 8,
//  澎湃 激   昂，
	4, 4, 4,4, 2,16,
//  澎 湃 激    昂，
	8, 6, 2,
//  我 们 从
	6,2, 8,
//  这   里
	4, 4, 6,2, 16,
//  这 里 启   航，
	4, 2,2, 6,2,
//  去 实   现
	6,2, 8,
//  心   中
	4, 4, 4, 6, 16,
//  心 中 的 梦  想。

	2,2,2,2, 4, 2,2,
//	风儿     传 颂着
	4, 2,2, 2, 6,
//  冶 金的 故 事，
	4, 2,2, 2,4,2, 16,
//  冶 金的  故     事，
	2,2,2,2, 4, 2,2,
//  心儿     放 飞着
	4, 2,2, 4, 4,
//  青 春的 梦 想，
	2, 4, 2, 4,2,2, 16,
//  青 春 的 梦      想。
	4, 2,2, 8,
//	让 我   们
	4,2,2, 8,
//  造     就
	4,2,2, 4,2,2,
//	金属的 风
	4,4,8,
//  骨，
	4,2,2, 4,4,
//  让我   们
	2,2,2,2, 8,
//  成       为
	4, 4, 2,4, 2,16,
//  祖 国 的栋  梁。
	8, 6,2,
//  为 了
	6,2, 8,
//  民   族
	4, 2,2, 4,4, 16,
//  民 族的 复    兴，
	4, 2,2, 6, 2,
//  不 辱   使 命
	2,2, 2,2, 8,
//  谱写 新   章，
	4, 4, 4,4, 2,16,
//  谱 写 新   章，
	8, 6, 2,
//  我 们 从
	6,2, 8,
//  这   里
	4, 4, 6,2, 16,
//  这 里 启   航，
	4, 2,2, 6,2,
//  去 拥   抱
	6,2, 8,
//  明   天
	4, 4, 4, 6, 20,
//  明 天 的 太  阳。
	4, 4, 4,
//  明 天 的
	8,8,16,
//  太
	16,16,16,
//  阳。
/****************************************
 * 	总 1128 / 4 = 282 拍
 * 一拍时间是 60 / 116 = 0.517 s
 * 四分之一拍的时间是	0.129 s
 * 此曲最小的时间是二分之一拍即 258 ms
*/
};
static unsigned char bMusic_tone[] = {
	0,8, 8,9, 10, 12,12,
//	告   别了  家  乡
	13, 12,10, 9, 8,
//  亲  切的   明 月，
	9, 9,10, 9,8,13, 8,
//  亲 切的  明      月，
	0,8,8,9, 10, 12,12,
//  迎来了   校   园
	13, 12,13, 15, 10,
//  灿  烂的   朝  阳，
	12, 12, 13, 12,10,9, 9,
//  灿  烂  的   朝      阳。
	10, 9,10, 12,
//	八  角    塘
	13,10,9, 8,
//  映       日
	10,12,13, 14,13,12,
//	荷花      别样
	12,13,13,
//  红，
	12,12,13, 15,10,
//  赣江      水
	9,8,9,10, 12,
//  源        头
	13, 12, 9,10, 8,8,
//  万  涓  泛波   浪。
	15, 15, 13,
//  走  进  这
	12,13, 15,
//  梦     想
	16, 16,15, 13,10, 12,
//  梦  想的    殿     堂，
	13, 12,13, 15, 13,
//  年  轻的   心   啊
	12,12, 12,10, 9,
//  澎湃   激     昂，
	13, 8, 9,10, 10,10,
//  澎  湃 激     昂，
	15, 15, 13,
//  我  们  从
	12,13, 15,
//  这     里
	16, 15, 13,12, 13,
//  这  里  启     航，
	12, 12,13, 15,10,
//  去  实     现
	9,10, 12,
//  心    中
	13, 15, 16, 16, 15,
//  心  中  的  梦  想。

	0,8,8,9, 10, 12,12,
//	风儿     传  颂着
	13, 12,10, 9, 8,
//  冶  金的   故 事，
	9, 9,10, 9,8,13, 8,
//  冶 金的  故      事，
	0,8,8,9, 10, 12,12,
//  心儿     放  飞着
	13, 12,13, 15, 10,
//  青  春的   梦  想，
	12, 12, 13, 12,10,9, 9,
//  青  春  的  梦       想。
	10, 9,10, 12,
//	让  我    们
	13,10,9, 8,
//  造       就
	10,12,13, 14,13,12,
//	金属的    风
	12,13,13,
//  骨，
	12,12,13, 15,10,
//  让我      们
	9,8,9,10, 12,
//  成        为
	13, 12, 9,10, 8,8,
//  祖  国  的栋  梁。
	15, 15,13,
//  为  了
	12,13, 15,
//  民     族
	16, 16,15, 13,10, 12,
//  民  族的   复     兴，
	13, 12,13, 15, 13,
//  不  辱     使  命
	12,12, 12,10, 9,
//  谱写   新     章，
	13, 8, 9,10, 10,10,
//  谱  写 新    章，
	15, 15, 13,
//  我  们  从
	12,13, 15,
//  这     里
	16, 15, 13,12, 13,
//  这  里  启     航，
	12, 12,13, 15,10,
//  去  拥     抱
	9,10, 12,
//  明    天
	13, 15, 16, 16, 15,
//  明  天  的  太  阳。
	12, 13, 15,
//  明  天  的
	16,17,10,
//  太
	15,8,0,
//  阳。
};

static __INLINE void music_pwm_output(u16 wFrequency)
{
	TIM4->ARR = wFrequency - 1;
	if (wFrequency == 1000)
		TIM4->CCR3 = 999;
	else
		TIM4->CCR3 = wFrequency / 2;
	if (TIM4->CNT > wFrequency)
		TIM4->EGR |= 1;
}

static __INLINE void TIM_PWM_OPEN(void)
{
	TIM4->CCMR2 |= (3 << 4);
	TIM4->CR1 |= (1 << 0);
}

static __INLINE void TIM_PWM_CLOSE(void)
{
	TIM4->CCMR2 &= ~(3 << 4);
	TIM4->CR1 &= ~(1 << 0);
}

u8 play_music_beep(u8 control)
{
	u8 res = 0;
	int temp;
	static u8 music_play_state = 0;
	static u16 music_play_step = MUSIC_LENGTH, tone_play_step_continue = 0;
	static u32 music_play_delay = 0, music_play_time = 0;

	if (control == MUSIC_PLAY) {
		music_play_step = 0;
		music_play_state = 0;
		TIM_PWM_OPEN();
	} else if (control == MUSIC_STOP) {
		music_play_step = MUSIC_LENGTH;
		TIM_PWM_CLOSE();
	}
	if (music_play_step < MUSIC_LENGTH) {
		if (!music_play_state) {
			music_play_state++;
			music_play_time = Sys_time;
			music_play_delay = bMusic_time[music_play_step] * MUSIC_STEP_TIME - 1;
			temp = bMusic_tone[music_play_step];
			tone_play_step_continue = tone_pwm_arr[temp & TONE_FLAG_Msk];
			music_pwm_output(tone_play_step_continue);
		} else if (Sys_time - music_play_time > music_play_delay) {
			music_play_step++;
			if (music_play_step == MUSIC_LENGTH) {
				TIM_PWM_CLOSE();
			}
			music_play_state = 0;
		}
		res = 1;
	} else {
		music_play_state = 0;
	}

	return res;
}
